src/cf/Catalogs/ПользователиМобильногоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПользователиМобильногоПриложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/МП_ОчередиСообщенийОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_ОчередиСообщенийОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Очередь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПользовательМобильногоПриложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиМобильногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/МП_СведенияОПользователях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МП_СведенияОПользователях</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПервоначальнойЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтметкаВремениСборкиДанных</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтметкаВремени</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПользовательМобильногоПриложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиМобильногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ПользователиМобильногоПриложения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПриложение(КодПриложения, Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодПриложения", КодПриложения);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПользователиМобильногоПриложения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПользователиМобильногоПриложения КАК ПользователиМобильногоПриложения
		|ГДЕ
		|	ПользователиМобильногоПриложения.Код = &КодПриложения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		НовыйЭлемент = Справочники.ПользователиМобильногоПриложения.СоздатьЭлемент();
		НовыйЭлемент.Пользователь = Пользователь;
		НовыйЭлемент.Код = КодПриложения;
		НовыйЭлемент.ДатаСоздания = ТекущаяДатаСеанса();
		НовыйЭлемент.Записать();
		Ссылка = НовыйЭлемент.Ссылка;
		
		// Привязка новой очереди сообщений и нового мобильного клиента
		МенеджерЗаписиОчередей = РегистрыСведений.МП_ОчередиСообщенийОбмена.СоздатьМенеджерЗаписи();
		МенеджерЗаписиОчередей.ПользовательМобильногоПриложения= Ссылка;
		МенеджерЗаписиОчередей.Записать();
	Иначе
		Ссылка = РезультатЗапроса.Выгрузить()[0].Ссылка;
	КонецЕсли;
	
	Возврат Ссылка;

КонецФункции

#КонецЕсли

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Данные.Ссылка) Тогда

		Сведения = РегистрыСведений.МП_СведенияОПользователях.ПолучитьСведения(Данные.Ссылка);

		Если Сведения <> Неопределено Тогда
			
			СтандартнаяОбработка = Ложь;
			Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1, акт. %2", Сведения.Описание, Сведения.ДатаПоследнейАктивности);
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Позволяет узнать, использует ли пользователь мобильное приложение
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - Пользователь (по умолчанию - текущий)
//
// Возвращаемое значение:
//   Булево - Истина, если пользователь найден, Ложь в противном случае
//
Функция ЭтоПользовательМП(Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПользователиМобильногоПриложения.Пользователь КАК Пользователь
		|ИЗ
		|	Справочник.ПользователиМобильногоПриложения КАК ПользователиМобильногоПриложения
		|ГДЕ
		|	ПользователиМобильногоПриложения.Пользователь = &Пользователь";
	
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

// Возвращает все активные приложения пользователя
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи, Неопределено - Целевой пользователь
//  	(если не задан - вычисляется текущий)
//
// Возвращаемое значение:
//   ПриложенияПользователя - Массив - Массив всех активных приложений пользователя
//
Функция АктивныеПриложенияПользователя(Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиМобильногоПриложения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПользователиМобильногоПриложения КАК ПользователиМобильногоПриложения
		|ГДЕ
		|	ПользователиМобильногоПриложения.Пользователь = &Пользователь
		|	И НЕ ПользователиМобильногоПриложения.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

//Получает всех пользователей мобильного приложения
// Параметры
//  ИсключитьПомеченныеНаУдаление - Булево - Включить запрос помеченных на удаление (по умолчанию - Ложь)
//
// ВозвращаемоеЗначение
//  ПользователиМП - Массив - пользователи МП
//
Функция ВсеПользователиМП(ИсключитьПомеченныеНаУдаление = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиМобильногоПриложения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПользователиМобильногоПриложения КАК ПользователиМобильногоПриложения
		|ГДЕ
		|	&УсловиеПоИсключениюПомеченных";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&УсловиеПоИсключениюПомеченных" ,
		?(ИсключитьПомеченныеНаУдаление, "Не ПользователиМобильногоПриложения.ПометкаУдаления", "Истина"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецЕсли
